// // See https://aka.ms/new-console-template for more information
// Console.WriteLine("Hello, World!");

// Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
// 456 -> 5
// 782 -> 8
// 918 -> 1

// int num = new Random().Next(100,1000);
// Console.WriteLine(num);

// int num1= num / 10;
// int num2= num1 /10;
// int result= num1-num2*10;

// Console.WriteLine(result);

// Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6

// int num = new Random().Next(10,1000);
// Console.WriteLine(num);

// int num1= num % 10;

// if (num>100)
// {
//     Console.WriteLine(num1);
// }
// else 
// {
//    Console.WriteLine("третьей цифры нет"); 
// }


// Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
// 6 -> да
// 7 -> да
// 1 -> нет

// Console.WriteLine("Введите число");
// int num = Convert.ToInt32(Console.ReadLine());



// if(num<6)
// {
//      Console.WriteLine("нет");
// }
// else if ((num==7)|| (num==6))
// {
//      Console.WriteLine("да");
// }
// else (num>7)
// {
//     Console.WriteLine("такого дня нет"); 
// }

// Почему-то не работает:(

