// // See https://aka.ms/new-console-template for more information
// Console.WriteLine("Hello, World!");

// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
// a = 5; b = 7 -> max = 7
// a = 2 b = 10 -> max = 10
// a = -9 b = -3 -> max = -3


// int max = 0;
// int min = 0;

// Console.Write("Введите число 1: ");
// int number1 = Convert.ToInt32(Console.ReadLine());

// Console.Write("Введите число 2: ");
// int number2 = Convert.ToInt32(Console.ReadLine());

// if(number1 > number2)
// {
//     max = number1;
//     min = number2;
// }
// else
// {
//     max = number2;
//     min = number1;
// }
// Console.WriteLine("max = " + max + " и " + "min = " + min);

// Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
// 2, 3, 7 -> 7
// 44 5 78 -> 78
// 22 3 9 -> 22

// int max = 0;

// Console.Write("Введите число 1: ");
// int number1 = Convert.ToInt32(Console.ReadLine());

// Console.Write("Введите число 2: ");
// int number2 = Convert.ToInt32(Console.ReadLine());

// Console.Write("Введите число 3: ");
// int number3 = Convert.ToInt32(Console.ReadLine());

// if (number1>max)
// {
//      max = number1;
// }
// if (number2>max)
// {
//     max = number2;
// }
// if (number3>max)
// {
//     max = number3;
// }
// Console.WriteLine("max = " + max);

// 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

// Console.Write("Введите число: ");
// int number = Convert.ToInt32(Console.ReadLine());

// int remDiv = number % 2;

//   if(remDiv == 0)
//   {
//     Console.WriteLine("да");
//   }     
//  else
//  {
//     Console.WriteLine("нет");
//  }

// Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.
// 5 -> 2, 4
// 8 -> 2, 4, 6, 8

// Не смогла решить 