// напишите программу, которая на вход принимает координаты точки X и Y, 
// причем X и y не равно 0 и выдает номер четверти плоскости, в которой находится эта точка

// Console.WriteLine("Введите число");
// int X = Convert.ToInt32(Console.ReadLine());

// Console.WriteLine("Введите число");
// int Y = Convert.ToInt32(Console.ReadLine());

// if (X>0 && Y>0)
// {
//     Console.WriteLine("1");
// }
// else if (X<0 && Y>0)
// {
//     Console.WriteLine("2");
// }
// else if (X<0 && Y<0)
// {
//     Console.WriteLine("3");
// }
// else if (X>0 && Y<0)
// {
//     Console.WriteLine("4");
// }
// else 
// {
//     Console.WriteLine("точка лежит на оси");
// }

//  напишите программу, которая по заданному номеру
//  четверти показывает диапозон взможных координат точки X Y

// Console.WriteLine("Введите число");
// int num= Convert.ToInt32(Console.ReadLine());

// if (num == 1)
// {
//     Console.WriteLine("X и Y больше 0");
// }
// else if (num == 2)
// {
//     Console.WriteLine("X меньше 0 и Y больше 0");
// }
// else if (num == 3)
// {
//     Console.WriteLine("X и Y меньше  0");
// }
// else if (num == 4)
// {
//     Console.WriteLine("X больше 0 и Y меньше 0");
// }
// else
// {
//     Console.WriteLine("такой четверти нет");
// }

//  Console.WriteLine("Введите число");
//  int num= Convert.ToInt32(Console.ReadLine());

//  switch(num)
//  {
//     case 1:
//     {
//         Console.WriteLine("X>0 Y>0");
//         break;
//     }
//      case 2:
//     {
//         Console.WriteLine("X<0 Y>0");
//         break;
//     }
//      case 3:
//     {
//         Console.WriteLine("X<0 Y<0");
//         break;
//     }
//      case 4:
//     {
//         Console.WriteLine("X>0 Y<0");
//         break;
//     }
//     default:
//     {
//         Console.WriteLine("не подходит");
//         break;
//     }

//  }

// напишите программу, которая принимает на вход координаты 2 точек
// и находит расстояние между ними в 2д пространстве

// double num= Math.Sqrt(25);
// System.Console.WriteLine(num);

// Console.WriteLine("Введите число");
// int X1= Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите число");
// int Y1= Convert.ToInt32(Console.ReadLine());

// Console.WriteLine("Введите число");
// int X2= Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите число");
// int Y2= Convert.ToInt32(Console.ReadLine());

// double s=Math.Sqrt((Math.Pow ((X2 -X1),2) + Math.Pow ((Y2 -Y1),2)));
// System.Console.WriteLine(s);

// напишите программу, которая на вход принимает число (N)
// и выдает таблицу квадратов чисел от 1 до N

// Console.WriteLine("Введите число");
// int num= Convert.ToInt32(Console.ReadLine());

// for(int i =1; i<=num; i++)
// {
//     Console.WriteLine(Math.Pow(i,2));
// }









